Revit 2024 API
IFCExternalServiceUIData.Dispose Method
Releases all resources used by the IFCExternalServiceUIData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace